{"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "Words", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 11, 300], "dtype": "float32", "sparse": false, "name": "Words"}, "inbound_nodes": []}, {"name": "POS", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 11, 8], "dtype": "float32", "sparse": false, "name": "POS"}, "inbound_nodes": []}, {"name": "A2", "class_name": "Bidirectional", "config": {"name": "A2", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm_1", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 500, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "concat"}, "inbound_nodes": [[["Words", 0, 0, {}]]]}, {"name": "B2", "class_name": "Bidirectional", "config": {"name": "B2", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm_2", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 10, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "concat"}, "inbound_nodes": [[["POS", 0, 0, {}]]]}, {"name": "A3", "class_name": "Dropout", "config": {"name": "A3", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "inbound_nodes": [[["A2", 0, 0, {}]]]}, {"name": "B3", "class_name": "Dropout", "config": {"name": "B3", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "inbound_nodes": [[["B2", 0, 0, {}]]]}, {"name": "A4", "class_name": "Flatten", "config": {"name": "A4", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["A3", 0, 0, {}]]]}, {"name": "B4", "class_name": "Flatten", "config": {"name": "B4", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["B3", 0, 0, {}]]]}, {"name": "A5", "class_name": "Dense", "config": {"name": "A5", "trainable": true, "dtype": "float32", "units": 300, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["A4", 0, 0, {}]]]}, {"name": "B5", "class_name": "Dense", "config": {"name": "B5", "trainable": true, "dtype": "float32", "units": 5, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["B4", 0, 0, {}]]]}, {"name": "Combine", "class_name": "Concatenate", "config": {"name": "Combine", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["A5", 0, 0, {}], ["B5", 0, 0, {}]]]}, {"name": "O2", "class_name": "Dense", "config": {"name": "O2", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Combine", 0, 0, {}]]]}, {"name": "O3", "class_name": "Dense", "config": {"name": "O3", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["O2", 0, 0, {}]]]}, {"name": "OUT", "class_name": "Dense", "config": {"name": "OUT", "trainable": true, "dtype": "float32", "units": 2, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["O3", 0, 0, {}]]]}], "input_layers": [["Words", 0, 0], ["POS", 0, 0]], "output_layers": [["OUT", 0, 0]]}, "keras_version": "2.3.1", "backend": "tensorflow"}